lab_meetings/research2020nov/NOTES.org
#+OPTIONS: toc:nil
#+LATEX_CLASS: article
#+AUTHOR: Mark Blyth
#+TITLE: MARK'S NOTES THAT MUSTN'T BE PRESENTED
#+DATE: [2020-11-04 Wed]

* Background
** Today's agenda

Been writing my annual review recently.
This presentation is aimed at giving an overview of that, as it nicely sums up what I've been up to so far, and what I want to get up to in the future.
Wasn't quite sure how much depth to go into, so if you have any questions, stop me at any point and ask!

  * *A brief summary of things*

  * More CBC

  * Results so far

  * Current work

  
* A brief summary of things
** What am I doing?
   * Neurons are interesting
     * Biological perspective: excitable cell; lots of reaction networks that produce surprisingly subtle functionalities within the cells
     * Philosophical perspective: individual cells are phenomenologically simple, yet collect them together into a brain and suddenly consiousness emerges. How? Why? Where from?
     * Mathematical perspective: neurons recieve their computational abilities from their intricate bifurcation structure, making them an excellent problem to study in nonlinear dynamics

   * Nonlinear dynamics teaches us lots about neurons
     * We have lots of good neuron models
     * These models predict all sorts of different behaviours, and can, and do!, explain experimental observations
     * As mathematicians, we tend to focus entirely on the model; even if it's not a good electrophysiological representation of a neuron, it doesn't necessarily matter as long as it has some interesting dynamics

   * Models are wrong
     * All models are wrong, but some are useful
     * The best models of the neurons are the cells themselves
     * What if we could perform our favourite analyses not on phenomenological models, but on the cells themselves?
     * Double win: we get interesting nonlinear dynamics to play with, /and/ the results are biologically useful!

** How am I doing it?
   * Models are often analysed using numerical continuation
     * Nonlinear dynamics are usually hard to study
     * Instead of pen-and-papering everything, we can outsource the labour to a computer
     * Numerical continuation lets us take something we can easily find, eg. equilibria, and track them to spot things that are harder to find, eg. bifurcations
     * Very powerful tool; very widely used

   * Numerical continuation needs a model
     * The model encodes our assumptions about how the cells work
     * If the assumptions are bad, the model will be unrepresentative, and the continuation results won't match reality
     * What if instead, we could run the same analysis without a model?

   * Control-based continuation doesn't
     * CBC let's us perform continuation experiments without the need for a model
     * If a system is observable and controllable, it's CBCable
     * My overall goal is to study neurons using CBC

** What needs to be done?
  * Make it fast
    * Neurons have a finite lifespan
    * We could leave a mechanical system oscillating for days on end, but if we tried that with neurons, they would die
    * There's some very slow steps in CBC; new mathematical techniques might allow some big speed-ups here

  * Make it noise-robust
    * CBC relies on experimental meausurements, which are often subject to lots of measurement noise
    * The CBC algo, solvers, etc. must therefore be robust in the face of noise
    * Furthermore, we could reasonably decide to model the neuron cells themselves as being a random dynamical system
    * Considerations of stochastic dynamics would be a whole new kettle of fish, and potentially a very interesting and useful one!
    * Stochastic continuation would be very useful eg. in aeroelastic flutter; perhaps treat turbulent fluid flow as a random influence, and see how the deterministic results change when randomness is considered

  * Make it happen
    * Everything so far has been in silico
    * That means I've been simulating mathematical models, instead of using real cells
    * Of course, the end goal is to move beyond models, so I'll need to consider how these methods would need to change for an experiment

** How are those TODOs progressing?
   * Efficiency
     * Current work; lots of problems, lots of progress
       * Currently studying how alternative discretisations could be employed to speed things up
       * Lots going wrong, but in research that seems to be a sign of good progress...
       * Very recently demonstrated it working for the first time; still lots of open questions, lots of issues about it not working how it should

   * Noise-robustness
     * One paper under review
       * Has been discussed in my previous research update
       * Essential idea is to take time-series data, fit a nonparametric regression model to it, and use that model in place of the data
       * If we choose the models well, they'll accurately separate signal from noise
       * Acts like an adaptive filter, allowing us to keep all the signal information, and none of the random fluctuations
       * Downside is that I'd consider it to have a very limited set of usage cases; most of the time it wouldn't be a useful thing to do
     * Other ideas under consideration
       * Idea that's been mentioned a while ago but I'm yet to do anything with
       * Replace continuation equations with a different set of equations that encodes exactly the same thing
       * New equations should be noise-robust, and robust against discretisation approximation errors
       * Big bonus: new equations can be solved efficiently with gradient-free methods, which will improve point 1 of efficiency
       * Second big bonus: efficient solver methods are probabilistic, so will likely perform better in the face of noise

   * Experiments
     * Minireview of literature
       * Had a look at microfluidic methods, electrode-based methods
       * Compared single-cell and multicell microfludidic approaches, in terms of captured nonlinear dynamics, and experimental viability
     * Some practical experience
       * Helped build some other microfluidics in the clean room, to get an understanding of how it's done and what they look like
   
* More CBC
** Today's agenda
  * A brief summary of things

  * *More CBC*

  * Results so far

  * Current work

  

