lab_meetings/research2020nov/NOTES.tex
% Created 2020-11-04 Wed 13:25
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[usenames,dvipsnames,svgnames,table]{xcolor}
\newenvironment{note}{\color{red}\bfseries ZZZ}


\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Mark Blyth}
\date{\textit{[2020-11-04 Wed]}}
\title{MARK'S NOTES THAT MUSTN'T BE PRESENTED}
\hypersetup{
 pdfauthor={Mark Blyth},
 pdftitle={MARK'S NOTES THAT MUSTN'T BE PRESENTED},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Background}
\label{sec:orgac975df}
\subsection{Today's agenda}
\label{sec:org0a28696}

Been writing my annual review recently.
This presentation is aimed at giving an overview of that, as it nicely sums up what I've been up to so far, and what I want to get up to in the future.
Wasn't quite sure how much depth to go into, so if you have any questions, stop me at any point and ask!

\begin{itemize}
\item \textbf{A brief summary of things}

\item More CBC

\item Results so far

\item Current work
\end{itemize}


\section{A brief summary of things}
\label{sec:org60c2056}
\subsection{What am I doing?}
\label{sec:org7cd7578}
\begin{itemize}
\item Neurons are interesting
\begin{itemize}
\item Biological perspective: excitable cell; lots of reaction networks that produce surprisingly subtle functionalities within the cells
\item Philosophical perspective: individual cells are phenomenologically simple, yet collect them together into a brain and suddenly consiousness emerges. How? Why? Where from?
\item Mathematical perspective: neurons recieve their computational abilities from their intricate bifurcation structure, making them an excellent problem to study in nonlinear dynamics
\end{itemize}

\item Nonlinear dynamics teaches us lots about neurons
\begin{itemize}
\item We have lots of good neuron models
\item These models predict all sorts of different behaviours, and can, and do!, explain experimental observations
\item As mathematicians, we tend to focus entirely on the model; even if it's not a good electrophysiological representation of a neuron, it doesn't necessarily matter as long as it has some interesting dynamics
\end{itemize}

\item Models are wrong
\begin{itemize}
\item All models are wrong, but some are useful
\item The best models of the neurons are the cells themselves
\item What if we could perform our favourite analyses not on phenomenological models, but on the cells themselves?
\item Double win: we get interesting nonlinear dynamics to play with, \emph{and} the results are biologically useful!
\end{itemize}
\end{itemize}

\subsection{How am I doing it?}
\label{sec:org1be5909}
\begin{itemize}
\item Models are often analysed using numerical continuation
\begin{itemize}
\item Nonlinear dynamics are usually hard to study
\item Instead of pen-and-papering everything, we can outsource the labour to a computer
\item Numerical continuation lets us take something we can easily find, eg. equilibria, and track them to spot things that are harder to find, eg. bifurcations
\item Very powerful tool; very widely used
\end{itemize}

\item Numerical continuation needs a model
\begin{itemize}
\item The model encodes our assumptions about how the cells work
\item If the assumptions are bad, the model will be unrepresentative, and the continuation results won't match reality
\item What if instead, we could run the same analysis without a model?
\end{itemize}

\item Control-based continuation doesn't
\begin{itemize}
\item CBC let's us perform continuation experiments without the need for a model
\item If a system is observable and controllable, it's CBCable
\item My overall goal is to study neurons using CBC
\end{itemize}
\end{itemize}

\subsection{What needs to be done?}
\label{sec:org4db8c52}
\begin{itemize}
\item Make it fast
\begin{itemize}
\item Neurons have a finite lifespan
\item We could leave a mechanical system oscillating for days on end, but if we tried that with neurons, they would die
\item There's some very slow steps in CBC; new mathematical techniques might allow some big speed-ups here
\end{itemize}

\item Make it noise-robust
\begin{itemize}
\item CBC relies on experimental meausurements, which are often subject to lots of measurement noise
\item The CBC algo, solvers, etc. must therefore be robust in the face of noise
\item Furthermore, we could reasonably decide to model the neuron cells themselves as being a random dynamical system
\item Considerations of stochastic dynamics would be a whole new kettle of fish, and potentially a very interesting and useful one!
\item Stochastic continuation would be very useful eg. in aeroelastic flutter; perhaps treat turbulent fluid flow as a random influence, and see how the deterministic results change when randomness is considered
\end{itemize}

\item Make it happen
\begin{itemize}
\item Everything so far has been in silico
\item That means I've been simulating mathematical models, instead of using real cells
\item Of course, the end goal is to move beyond models, so I'll need to consider how these methods would need to change for an experiment
\end{itemize}
\end{itemize}

\subsection{How are those TODOs progressing?}
\label{sec:org03f83a2}
\begin{itemize}
\item Efficiency
\begin{itemize}
\item Current work; lots of problems, lots of progress
\begin{itemize}
\item Currently studying how alternative discretisations could be employed to speed things up
\item Lots going wrong, but in research that seems to be a sign of good progress\ldots{}
\item Very recently demonstrated it working for the first time; still lots of open questions, lots of issues about it not working how it should
\end{itemize}
\end{itemize}

\item Noise-robustness
\begin{itemize}
\item One paper under review
\begin{itemize}
\item Has been discussed in my previous research update
\item Essential idea is to take time-series data, fit a nonparametric regression model to it, and use that model in place of the data
\item If we choose the models well, they'll accurately separate signal from noise
\item Acts like an adaptive filter, allowing us to keep all the signal information, and none of the random fluctuations
\item Downside is that I'd consider it to have a very limited set of usage cases; most of the time it wouldn't be a useful thing to do
\end{itemize}
\item Other ideas under consideration
\begin{itemize}
\item Idea that's been mentioned a while ago but I'm yet to do anything with
\item Replace continuation equations with a different set of equations that encodes exactly the same thing
\item New equations should be noise-robust, and robust against discretisation approximation errors
\item Big bonus: new equations can be solved efficiently with gradient-free methods, which will improve point 1 of efficiency
\item Second big bonus: efficient solver methods are probabilistic, so will likely perform better in the face of noise
\end{itemize}
\end{itemize}

\item Experiments
\begin{itemize}
\item Minireview of literature
\begin{itemize}
\item Had a look at microfluidic methods, electrode-based methods
\item Compared single-cell and multicell microfludidic approaches, in terms of captured nonlinear dynamics, and experimental viability
\end{itemize}
\item Some practical experience
\begin{itemize}
\item Helped build some other microfluidics in the clean room, to get an understanding of how it's done and what they look like
\end{itemize}
\end{itemize}
\end{itemize}
