lab_meetings/research2020nov/NOTES.org
** Control-based continuation
This has been explained many times before, in the lab group meetings, so I'll keep things brief here and give only the very high-level overview.

   * CBC works by tracking non-invasive control targets
     * This is a control target that corresponds to something the system was already doing
     * The controller therefore doesn't change how the system was behaving
     * The only difference between the controlled and uncontrolled system, in this case, is that unstable equilibria and periodic orbits are stabilised, so they become visible
     * Since they become visible, we can see how they move when we change a parameter
     * This `seeing how they move' step is done with a continuation algo, in much the same way as with `normal' continuation

   * It has been tested on `nice' systems, but biological systems aren't nice
     * By `nice', I mean...
       * Deterministic: no randomness within the dynamics
       * Low noise in the observations
       * `Simple' signals, with few high-frequency components; well-approximated by a shifted sine wave, as the dynamics are only weakly nonlinear
     * Biological systems, such as neurons, don't follow the niceness rules
       * Dynamics may be stochastic
       * There's often quite a lot of measurement noise
       * The signals are from a strongly nonlinear oscillator; have lots of high-frequency components; very very different to a sine wave

   * Discretisation is a key part of this
     * Finding and tracking the noninvasive control targets requires us to solve for the fixed point of some map
     * This map maps from a function to a function
     * Instead of working with the continuous, infinite-dimensional map, we instead approximate it with a finite, lower-dimensional map, in a process called discretisation
     * We then attempt to solve the finite-dimensional equations using standard numerical methods, and hope that the results of the discretised case correspond to a solution of the original, continuous problem
     * I don't know if these hopes are actually valid, and nor would I know how to prove that
       
I'll get back to the topic of discretisation later, as that's a key part of my current research.
     
* Results so far
** Today's agenda
   
I have a couple of results so far.
These are a tutorial paper, currently under review, and a conference paper, also currently under review.
I'll talk briefly about these here.

  * A brief summary of things

  * More CBC

  * *Results so far*

  * Current work

  

** Paper 1: `Tutorial of \dots'
#+begin_center
Tutorial of numerical continuation for systems and synthetic biology
#+end_center

  * Already mentioned that numerical continuation is a very standard, widespread tool in nonlinear dynamics
  * I spent a long time playing around with different continuation softwares while learning about neuronal dynamics
  * This paper aims to bridge the gap between biologists and mathematicians
  * Aims to expose numerical continuation, and some key ideas from nonlinear dynamics, to researchers without a nonlinear dynamics background
  * Uses lots of examples to give a conceptual, high-level overview of the topic, so that readers can go on to understand work that builds on continuation, bifurcation theory, and so on

** Paper 2: `Bayesian local \dots'
   
#+begin_center
Bayesian local surrogate models for the control-based continuation of multiple-timescale systems
#+end_center

   * Noise-robustness is important in CBC
     * A point I touched on earlier
     * Lots of ways noise could enter the system
     * We can't treat noise as a negligable side-issue; we must pay active attention to dealing with it
     * This paper aims to do that, by using an adaptive filtering method

   * Surrogate modelling is a possible route towards noise-robust experiments
     * Instead of running CBC using raw noise-corrupted experimental measurements, we could instead filter the data
     * Filtering needs to be done carefully!
       * If we whack the data through a simple low-pass filter, we'll cut off the all-important high-frequency information
     * Instead of using a simple low-pass filter, let's use a complicated one!
     * Take the time series data
     * Fit a nonparametric regression model to it
     * With a well-chosen model, we can filter out the noise
     * This works because a statistical model of the time series will describe the data as signal + noise; we fit a model to the signal part of it, and throw away the noise residuals
     * We can then use the surrogate in place of the original data, to perform whichever analyses we wanted to do
     * We can discretise the surrogate more accurately than we can the original data

* Current work
** Today's agenda

That's a very brief summary of what I'm trying to acheive and what I've finished working on so far.
Now we're going to move on to what I'm currently working on, and what I want to achieve next.

  * A brief summary of things

  * More CBC

  * Results so far

  * *Current work*

  
    
** Periodic splines discretisation
   * Discretisation is important
     * The continuation equations are infinite-dimensional
     * We have a map that takes a function as its input, and gives a function as its output
     * We're searching for a function that remains unchanged when passed through this map
     * Such a function exists, but to find it we need to reduce the problem to something more tractable
     * This is where discretisation comes in
     * We approximate the infinite-dimensional problem with a finite-dimensional problem
     * The finite-dimensional problem is then tackled using standard numerical methods

   * Efficiency is also important
     * Another point I touched on earlier
     * We want the experiments to run quickly, so that our cells survive
     * A big issue in making this happen is the gradient step
     * We're using numerical solvers on our continuation equatiosn
     * Virtually all numerical solvers require a gradient to work
     * Finding the gradient of an experimental system requires finite differences
     * This means perturbing the input vector slightly, and noting how the output vector changes
     * More elements in the input vector means more time spent perturbing, running to convergence, and measuring
     * This all takes time
     * Therefore, to speed things up, we want the fewest elements possible in our vector
     * IE. we need a low-dimensional discretisation

   * Splines could be efficient discretisors
     * Neuronal signals have lots of high-frequency energy
     * This HF energy is what gives the signals their spiking shapes
     * The issue with this is that Fourier discretisation, as used so far in CBC, would require huge numbers of Fourier harmonics
     * This gives a big discretisation, which means slow finite differences, and inefficient experiments
     * Spline models are smooth piecewise-polynomial models
     * We can make them periodic, too
     * We can fit very complex curves by connecting the dots with pieces of polynomial
     * This makes them a good discretisor candidate!
     * Ideal: replace the Fourier basis functions with spline basis functions, for a novel discretisation
     * This is my current work
     * Bonus: spline discretisation might be more noise-robust, too
     * Or it might not be

