lab_meetings/research2020nov/NOTES.tex

\section{More CBC}
\label{sec:org007c0dd}
\subsection{Today's agenda}
\label{sec:orgc0ebdd9}
\begin{itemize}
\item A brief summary of things

\item \textbf{More CBC}

\item Results so far

\item Current work
\end{itemize}



\subsection{Control-based continuation}
\label{sec:orgbce1316}
This has been explained many times before, in the lab group meetings, so I'll keep things brief here and give only the very high-level overview.

\begin{itemize}
\item CBC works by tracking non-invasive control targets
\begin{itemize}
\item This is a control target that corresponds to something the system was already doing
\item The controller therefore doesn't change how the system was behaving
\item The only difference between the controlled and uncontrolled system, in this case, is that unstable equilibria and periodic orbits are stabilised, so they become visible
\item Since they become visible, we can see how they move when we change a parameter
\item This `seeing how they move' step is done with a continuation algo, in much the same way as with `normal' continuation
\end{itemize}

\item It has been tested on `nice' systems, but biological systems aren't nice
\begin{itemize}
\item By `nice', I mean\ldots{}
\begin{itemize}
\item Deterministic: no randomness within the dynamics
\item Low noise in the observations
\item `Simple' signals, with few high-frequency components; well-approximated by a shifted sine wave, as the dynamics are only weakly nonlinear
\end{itemize}
\item Biological systems, such as neurons, don't follow the niceness rules
\begin{itemize}
\item Dynamics may be stochastic
\item There's often quite a lot of measurement noise
\item The signals are from a strongly nonlinear oscillator; have lots of high-frequency components; very very different to a sine wave
\end{itemize}
\end{itemize}

\item Discretisation is a key part of this
\begin{itemize}
\item Finding and tracking the noninvasive control targets requires us to solve for the fixed point of some map
\item This map maps from a function to a function
\item Instead of working with the continuous, infinite-dimensional map, we instead approximate it with a finite, lower-dimensional map, in a process called discretisation
\item We then attempt to solve the finite-dimensional equations using standard numerical methods, and hope that the results of the discretised case correspond to a solution of the original, continuous problem
\item I don't know if these hopes are actually valid, and nor would I know how to prove that
\end{itemize}
\end{itemize}

I'll get back to the topic of discretisation later, as that's a key part of my current research.

\section{Results so far}
\label{sec:org2e0036c}
\subsection{Today's agenda}
\label{sec:org75eaf77}

I have a couple of results so far.
These are a tutorial paper, currently under review, and a conference paper, also currently under review.
I'll talk briefly about these here.

\begin{itemize}
\item A brief summary of things

\item More CBC

\item \textbf{Results so far}

\item Current work
\end{itemize}



\subsection{Paper 1: `Tutorial of \dots{}'}
\label{sec:org3a79022}
\begin{center}
Tutorial of numerical continuation for systems and synthetic biology
\end{center}

\begin{itemize}
\item Already mentioned that numerical continuation is a very standard, widespread tool in nonlinear dynamics
\item I spent a long time playing around with different continuation softwares while learning about neuronal dynamics
\item This paper aims to bridge the gap between biologists and mathematicians
\item Aims to expose numerical continuation, and some key ideas from nonlinear dynamics, to researchers without a nonlinear dynamics background
\item Uses lots of examples to give a conceptual, high-level overview of the topic, so that readers can go on to understand work that builds on continuation, bifurcation theory, and so on
\end{itemize}

\subsection{Paper 2: `Bayesian local \dots{}'}
\label{sec:org29e5bc9}

\begin{center}
Bayesian local surrogate models for the control-based continuation of multiple-timescale systems
\end{center}

\begin{itemize}
\item Noise-robustness is important in CBC
\begin{itemize}
\item A point I touched on earlier
\item Lots of ways noise could enter the system
\item We can't treat noise as a negligable side-issue; we must pay active attention to dealing with it
\item This paper aims to do that, by using an adaptive filtering method
\end{itemize}

\item Surrogate modelling is a possible route towards noise-robust experiments
\begin{itemize}
\item Instead of running CBC using raw noise-corrupted experimental measurements, we could instead filter the data
\item Filtering needs to be done carefully!
\begin{itemize}
\item If we whack the data through a simple low-pass filter, we'll cut off the all-important high-frequency information
\end{itemize}
\item Instead of using a simple low-pass filter, let's use a complicated one!
\item Take the time series data
\item Fit a nonparametric regression model to it
\item With a well-chosen model, we can filter out the noise
\item This works because a statistical model of the time series will describe the data as signal + noise; we fit a model to the signal part of it, and throw away the noise residuals
\item We can then use the surrogate in place of the original data, to perform whichever analyses we wanted to do
\item We can discretise the surrogate more accurately than we can the original data
\end{itemize}
\end{itemize}

\section{Current work}
\label{sec:orgd2f495b}
\subsection{Today's agenda}
\label{sec:orgfac0ff3}

That's a very brief summary of what I'm trying to acheive and what I've finished working on so far.
Now we're going to move on to what I'm currently working on, and what I want to achieve next.

\begin{itemize}
\item A brief summary of things

\item More CBC

\item Results so far

\item \textbf{Current work}
\end{itemize}



\subsection{Periodic splines discretisation}
\label{sec:org8f57c54}
\begin{itemize}
\item Discretisation is important
\begin{itemize}
\item The continuation equations are infinite-dimensional
\item We have a map that takes a function as its input, and gives a function as its output
\item We're searching for a function that remains unchanged when passed through this map
\item Such a function exists, but to find it we need to reduce the problem to something more tractable
\item This is where discretisation comes in
\item We approximate the infinite-dimensional problem with a finite-dimensional problem
\item The finite-dimensional problem is then tackled using standard numerical methods
\end{itemize}

\item Efficiency is also important
\begin{itemize}
\item Another point I touched on earlier
\item We want the experiments to run quickly, so that our cells survive
\item A big issue in making this happen is the gradient step
\item We're using numerical solvers on our continuation equatiosn
\item Virtually all numerical solvers require a gradient to work
\item Finding the gradient of an experimental system requires finite differences
\item This means perturbing the input vector slightly, and noting how the output vector changes
\item More elements in the input vector means more time spent perturbing, running to convergence, and measuring
\item This all takes time
\item Therefore, to speed things up, we want the fewest elements possible in our vector
\item IE. we need a low-dimensional discretisation
\end{itemize}

\item Splines could be efficient discretisors
\begin{itemize}
\item Neuronal signals have lots of high-frequency energy
\item This HF energy is what gives the signals their spiking shapes
\item The issue with this is that Fourier discretisation, as used so far in CBC, would require huge numbers of Fourier harmonics
\item This gives a big discretisation, which means slow finite differences, and inefficient experiments
\item Spline models are smooth piecewise-polynomial models
\item We can make them periodic, too
\item We can fit very complex curves by connecting the dots with pieces of polynomial
\item This makes them a good discretisor candidate!
\item Ideal: replace the Fourier basis functions with spline basis functions, for a novel discretisation
\item This is my current work
\item Bonus: spline discretisation might be more noise-robust, too
\item Or it might not be
\end{itemize}
\end{itemize}
