lab_meetings/research2020nov/NOTES.tex

\subsection{Current issues}
\label{sec:org98983d2}

\begin{itemize}
\item Newton solvers don't converge on a solution
\begin{itemize}
\item The discretised continuation equations are a set of nonlinear equations whereby we put in some vector, and get a vector as an output
\item If the vector represents a noninvasive control target, the continuation equations will give the zero-vector as their output
\item Therefore, the Newton iterations seek some input vector that solves these equations, and we know we've solved them when we plug the solution in and get zero out
\item Unfortunately, the Newton iterations converge on a vector that doesn't actually solve the system
\item The steps become negligable, but the resulting vectors don't solve the equations
\item This is a problem, as it means the accepted results are wrong
\item Nevertheless, a solution must exist, as it can be found using non-Newton solving methods
\item My current hunch is that the issues are arising as a result of difficulties in calculating the gradient accurately
\end{itemize}

\item The solution curve becomes numerically unstable
\begin{itemize}
\item As seen in the diagram, the solution jumps shortly after the second fold
\item The real (analytic) solution does not jump, so clearly this is the result of something going wrong with the numerics
\item My hope is that if I can find a solution to the gradient problem, it will fix this too
\end{itemize}

\item Current work is therefore trying to fix this, so that I can test out the novel discretisation methods on neuronal data; all my discretisor experiments so far are on the weakly nonlinear Duffing oscillator
\end{itemize}
\end{document}
